In [4]:
import pandas as pd
data = pd.read_csv("CC_Expenses_Exercise.csv")

In [21]:
data.shape

(30, 4)

In [5]:
data.head()

   SL No.  Sex  Shopping  Banking  Credit_Card_usage
0       1    1         1        1                140
1       2    2         2        2                 20
2       3    2         1        2                 30
3       4    2         1        2                 30
4       5    1         1        1                130

In [6]:
data.tail()

    SL No.  Sex  Shopping  Banking  Credit_Card_usage
25      26    1         1        1                130
26      27    2         1        1                 40
27      28    2         2        2                 20
28      29    1         1        2                 40
29      30    1         1        2                 30

In [20]:
data.describe()

             Sex   Shopping    Banking  Credit_Card_usage
count  30.000000  30.000000  30.000000          30.000000
mean    1.500000   1.433333   1.700000          66.000000
std     0.508548   0.504007   0.466092          42.959484
min     1.000000   1.000000   1.000000          20.000000
25%     1.000000   1.000000   1.000000          30.000000
50%     1.500000   1.000000   2.000000          55.000000
75%     2.000000   2.000000   2.000000          90.000000
max     2.000000   2.000000   2.000000         150.000000

In [19]:
data = data.drop("SL No.",axis=1)

In [23]:
data.groupby("Sex",axis=1)

C:\Users\SU\AppData\Local\Temp\ipykernel_6744\2483039496.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  data.groupby("Sex",axis=1)